<template>
	<div class="g-doc" id="Jdoc">
        <div class="wraper">
            <div class="container">
                <div class="swiper-container">
                    <div class="swiper-wrapper">
                        <div class="swiper-slide">
                            <pre>
注册协议

【审慎阅读】您在申请注册流程中点击同意前，应当认真阅读以下协议。请您务必审慎阅读、充分理解协议中相关条款内容，其中包括：

1、与您约定免除或限制责任的条款；

2、与您约定法律适用和管辖的条款；

3、其他以粗体下划线标识的重要条款。

如您对协议有任何疑问，可即时向平台客服咨询。

【特别提示】当您按照注册页面提示填写信息、阅读并同意协议且完成全部注册程序后，即表示您已充分阅读、理解并接受协议的全部内容。如您因平台服务与石管家发生争议的，适用《石管家服务协议》处理。

阅读协议的过程中，如果您不同意相关协议或其中任何条款约定，您应立即停止注册程序。

《石管家服务协议》

提示条款

欢迎阅读石管家服务使用协议(下称“本协议”)。本协议阐述之条款和条件适用于您使用石管家 (manager.soushi88.com)所提供的包括但不限于板材管理功能、订单管理功能、通讯录管理功能等服务(下称“服务”)。石管家的网络运营服务由广州找石材网络科技有限公司向您提供。本网站上服务描述以及其它内容中的“石管家”均指广州找石材网络科技有限公司。石管家基于以下条件提供石管家服务。

第一条 接受条款

以任何方式注册或登录石管家即表示您同意自己已经与石管家平台订立本协议，且您将受本协议的条款和条件(下称“条款”) 约束。

石管家平台可随时自行全权决定更改“条款”。如您不同意相关变更，必须停止使用“服务”。经修订的“条款”一经在石管家公布后，立即自动生效。

您应在第一次登录后仔细阅读修订后的“条款”，并有权选择停止继续使用“服务”；一旦您继续使用“服务”，则表示您已接受经修订的“条款”，当您与石管家发生争议时，应以最新的服务协议为准。

除另行明确声明外，任何使“服务”范围扩大或功能增强的新内容均受本协议约束。除非经石管家的授权高层管理人员签订书面协议，本协议不得另行作出修订。

本“服务”仅供能够根据相关法律订立具有法律约束力的合约的个人或公司使用。因此，您的年龄必须在十八周岁或以上，才可使用本公司服务。如不符合本项条件，请勿使用“服务”。

石管家可随时自行全权决定拒绝向任何人士提供“服务”。“服务”不会提供给被暂时或永久中止资格的石管家会员使用。

第二条 会员注册方法

用户注册后可以直接登录石管家免费管理板材信息、商家发布板材信息到搜石网商城(www.soushi88.com)、管理用户帐号下的公司信息管理。石管家会员实行免费会员制度,注册用户可免费使用石管家提供的功能和服务，注册会员对所提交的任何信息的真实性和合法性负责。

第三条 会员的权力和义务

会员的权利：

参与交易及与交易相关的活动（包括但不限于发布要约、进行承诺、缔结协议、履行协议等）；

使用石管家的有关设施，享用石管家提供的信息和相关服务；

申请暂停、恢复或注销会员资格；

石管家规定的其他权利。

会员的义务：

遵守国家法律、法规以及石管家已公布的相关规定，接受找石管家的监督与管理；

造成石管家及其他会员损失的，应承担赔偿责任；

保护自己的账号和交易密码，并对因其在石管家使用所生的结果负责；

主动了解石管家发布的业务信息、公告和各项制度，并承担未尽合理关注造成的损失；

按石管家规定的标准配备相关网络设施；

发生重大情况变更时及时通知石管家。

第四条 会员注册时已保证

会员注册时必须保证知悉本协议及其他已公开的所有文件规定的条款、条件，并承诺遵守该等条款、条件。本协议对石管家所有注册会员具有绝对约束力。

提交的会员资料真实、准确、完整；

维持并及时更新会员资料，并保持会员资料的连续性，否则石管家有权终止会员资格，并拒绝在任何时间向您提供任何服务；

对因资料不实引发的纠纷，由资料提供方负全部责任；

您不得在石管家公布或通过石管家进行以下行为： 发布上架可能使石管家或搜石网违反任何相关法律、法规、条例或规章的任何物品信息或发布上架石管家认为应禁止或不适合通过搜石网买卖的任何物品。

第五条 会员资格的终止

会员可以在任何时间停止使用本网站并向石管家申请终止其会员资格。

会员同意，石管家根据本协议及相关规则的任何规定终止会员资格的措施可在不发出事先通知的情况下实施，会员资格终止后，会员的账号立即无效，石管家将撤销账号以及在账号内的所有相关资料和档案。会员资格终止后，石管家将没有义务为会员保留原账号及与之相关的任何信息。

会员资格终止时，会员无条件同意以下规则：

全面适当履行所有未完成之交易；

全面适当履行与第三人在该会员资格终止或届满前有可能确认的交易；

与石管家结清所有款项；

申请终止会员资格时，会员应向石管家提出书面申请，并办理以下事项：

（1）全面适当履行所有未完成之交易；

（2）了结在搜石网的全部债权、债务及费用；

（3）其他应当办理的事项；

会员有下列情形之一的，石管家有权终止会员资格，由此产生的一切法律上和经济上的责任由该会员承担：

（1）扰乱交易秩序或恶意损害其他会员利益的；

（2）提供虚假资料或虚假信息的；

（3）违反国家法律、法规或石管家网相关规定或制度的。

（4）石管家认为应该终止会员资格的其他情形； 

第六条 会员注册名、密码和保密

在登记过程中，您将使用手机号码作为会员注册名并自主创建密码。

您须自行负责对您的会员注册名和密码保密，且须对您在会员注册名和密码下发生的所有活动承担责任。

您同意：如发现任何人未经授权使用您的会员注册名或密码，或发生违反保密规定的任何其他情况，您会立即通知石管家；及确保您在每个上网时段结束时，以正确步骤离开网站。

石管家不能也不会对因您未能遵守本款规定而发生的任何损失或损毁负责。您不得向任何第三者披露您的密码，或与任何第三者共用您的密码，或为任何未经批准的目的使用您的密码。

第七条 关于您的资料的规则

您同意，并保证“您的资料”和您供在搜石网上交易的任何“物品”（泛指一切可供依法交易的、有形的或无形的、以各种形态存在的某种具体的物品，或某种权利或利益，或某种票据或证券，或某种服务或行为。本协议中“物品”一词均含此义）符合以下规则 ：

不会有欺诈成份，与售卖伪造或盗窃无涉；

不会侵犯任何第三者对该物品享有的物权，或版权、专利、商标、商业秘密或其他知识产权，或隐私权、名誉权； 

不会违反任何法律、法规、条例或规章 (包括但不限于关于规范出口管理、贸易配额、保护消费者、不正当竞争或虚假广告的法律、法规、条例或规章)； 

不会含有诽谤（包括商业诽谤）、非法恐吓或非法骚扰的内容； 

不会含有淫秽、或包含任何儿童色情内容； 

不会含有蓄意毁坏、恶意干扰、秘密地截取或侵占任何系统、数据或个人资料的任何病毒、伪装破坏程序、电脑蠕虫、定时程序炸弹或其他电脑程序； 

不会直接或间接与下述各项货物或服务连接，或包含对下述各项货物或服务的描述：本协议项下禁止的货物或服务；或您 无权连接或包含的货物或服务。此外，您同意不会：在与任何连锁信件、大量胡乱邮寄的电子邮件、滥发电子邮件或任何复制或多余的信息有关的方面使用“服务”；未经其他人士同意，利用“服务”收集其他人士的电子邮件地址及其他资料；或利用“服务”制作虚假的电子邮件地址，或以其他形式试图在发送人的身份或 信息的来源方面误导其他人士；

您不得在本公司网站公布或通过本公司网站买卖：可能使本公司违反任何相关法律、法规、条例或规章的任何物品；或搜石网认为应禁止或不适合通过本网站买卖的任何物品；

第八条 系统完整性

您同意，您不得使用任何装置、软件或例行程序干预或试图干预石管家的正常运作或正在本公司网站上进行的任何交易。您不得采取对任何将不合理或不合比例的庞大负载加诸本公司网络结构的行动。

第九条 服务说明

石管家为会员提供信息收集、交流以及石管家公布的各类规则所规定的各类网上交易和服务。

石管家不承担因会员提供的任何信息而产生的任何责任，也不承担会员与其它会员之间因网上或线下交易而产生的本协议或各类规则规定之外的其他责任。

会员同意，石管家有权独立判断会员的行为是否符合本协议及相关规则的要求。石管家可随时中断对违反本协议及相关规则内容的会员的服务。

第十条 责任范围

您明确理解和同意，石管家不对因下述任一情况而发生的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失的损害赔偿 (无论石管家是否已被告知该等损害赔偿的可能性)：使用或未能使用“服务”；

因通过或从“服务”购买或获取任何数据、资料或服务，或通过或从“服务”接收任何信息或缔结任何交易所产生的获取替代货物和服务的费用；

未经批准接入或更改您的传输资料或数据；任何第三者对“服务”的声明或关于“服务”的行为；或因任何原因而引起的与“服务”有关的任何其他事宜，包括疏忽。

对于因本公司合理控制范围以外的原因，包括但不限于自然灾害、罢工或骚乱、物质短缺或定量配给、暴动、战争行为、政府行为、通讯或其他设施故障或严重伤亡事故等，致使本公司延迟或未能履约的，石管家不对您承担任何责任。

第十一条 责任豁免条款及赔偿

会员同意:石管家不对会员或任何第三人因下列情况引起的损失负责：

因不可抗力（包括但不限于地震、台风、水灾、火灾、战争及其他不能预见、不能避免且不可克服的客观事件）导致的；

因石管家不可预测或无法控制的系统故障、设备故障、通讯故障、停电、黑客攻击等突发事件给会员造成的损失；

石管家终止会员资格或拒绝会员接入的；

有关商品或服务违反或被指称违反任何保证的；

非法使用会员的名称、账号、密码登录的；

非经授权获取或更改会员所传送的信息或数据的；

服务中的任何第三人的声明或行为；

在任何情况下，石管家对会员的损失、损害或请求的全部责任不应超过会员向石管家已支付的与该争议标的有关的金额。

赔偿

会员保证石管家（搜石网）不会因会员出售的商品或服务不符合约定或违反保证而遭受任何索赔或承担任何责任。

会员同意在出现本条第一项所述情况时，对搜石网的损失给予全额赔偿，包括调查、准备或诉讼所应支付的合理费用。

第十二条 法律适用及争议解决

本协议受中华人民共和国法律管辖。发生争议时，如对有关业务规则有不同的理解的，以在网站上最新颁布的为准并据之解释。

因履行和解释本协议及相关规则发生的争议，石管家与会员、会员与会员须先依友好协商方式解决。如在一方向另一方发出要求协商解决的书面通知之日 15日内争议仍未得到解决，则任何一方均可向石管家所在地有管辖权的人民法院提起诉讼。

石管家与会员、会员与会员在对争议事项进行协商、和解、调解、诉讼的过程中，应继续履行本协议除争议事项外的其他条款。

本会员注册服务条款由石管家负责解释。 


《隐私声明》

本网站由广州找石材网络科技有限公司运营并由其关联公司提供各种支持（以下广州找石材网络科技有限公司及其关联公司合称“我们”）。我们理解您关心您的信息是如何被使用和共享的。非常感谢您相信我们对此事处理的谨慎和敏感。本声明将阐述我们对隐私权保护的政策。如您访问soushi88.com（本网站），您同意接受本隐私声明。

    我们采集客户的哪些个人信息？
    什么是Cookies
    我们是否会与他人共享所收到的信息？
    关于我的信息安全？
    第三方广告商和其它网站链接
    我能获取哪些信息？
    我有哪些选择？
    是否允许儿童使用本网站？
    使用条件、通知和修订？
    信息采集实例？
    移动设备

我们采集您的哪些个人信息？

我们从客户得到的信息将帮助我们为客户在本网站的购物提供个性化服务，并且不断提升客户购物体验。我们采集的信息种类如下：

    您向我们提供的信息：我们接收并存储您在我们网站上或以其他任何方式提供给我们的任何信息。您可以选择不提供某些信息，但是这样可能使您无法使用本网站的许多特色服务。我们使用您提供的信息是为了回应您的要求，为您将来在本网站购物提供个性化服务，改善我们的网站以及与您进行沟通。
    自动获取的信息：无论您何时与我们进行沟通，我们接收并储存特定的信息。例如，与其他许多网站一样，我们使用cookies。当您的网络浏览器访问本网站或由我们或代表我们在其它网站上提供的广告及其他内容时，我们将获得某些信息。
    移动设备：当您下载或使用本网站及其关联公司开发的应用时，我们将可能收到关于您所处位置以及您的移动设备的信息，其中包含识别您的移动设备的特定号码。我们将使用这些信息为您提供基于位置的定位相关服务，例如广告，本网站搜索结果，以及其它个人信息。大多数移动设备将允许您关闭定位服务。如需了解如何关闭定位服务，请点击这里。
    电子邮件通讯：为帮助我们把电子邮件变得更有用途和更有趣味，在您打开来自本网站的电子邮件时，如果您的计算机支持一些功能，我们通常会收到一封关于您已收悉电子邮件的确认。我们也会将我们的客户名单与收到的其它公司的名单进行对比，以避免向我们的客户发送不必要的信息。如果您不希望继续收到我们的电子邮件或其它信函，请调整您的帐户中的客户通讯选项。
    从其他来源获得的信息：我们可能从其他来源收到关于您的信息并且将其加入我们的客户信息库。

什么是Cookies？

    cookies是一种为您设备提供的能够识别您的设备的特定识别符号，从而使我们的系统能够识别您的设备，并向您提供诸如一键下单、为您推荐商品、在其它网站上的个性化广告（例如由本网站提供内容的联盟网站）以及在您多次访问间隔时保存您的购物车中所选商品的记录等特色服务。
    多数浏览器上工具条中的帮助部分会告诉您怎样防止您的浏览器接受新的cookies，怎样让您的浏览器在您收到一条新cookies时通知您或者怎样彻底关闭cookies。此外，您可以通过改变浏览器附加程序（browser add-ons）的设置，或通过访问其制造商的网页，来关闭或删除浏览器附加程序使用的类似数据（诸如Flash cookies）。不过，cookies能让您充分利用本网站最优秀的特色服务，所以我们建议您将其设置为打开状态。例如，如果您关闭或拒绝接受我们的cookies, 您将不能使用向您的购物车添加商品、进入结算页面、或者使用您需要登录后才能使用的本网站产品和服务。

我们是否会与他人共享所收到的信息？

客户的信息是我们业务重要的一部分，我们不会将其转卖给他人。我们仅以下述方式与适用本隐私声明或至少提供与本隐私声明同样保护性惯例的本网站关联公司分享客户信息。

    不受我们控制的合作商家：我们与合作商家有密切的合作。在有些情况下（例如第三方卖家），这些卖家在本网站开店或在本网站上作为卖家向您销售商品。在另一些情况下，我们会与一些卖家联合开店、提供服务或销售产品。您可以辨别您的交易何时会涉及第三方卖家，我们与该第三方卖家分享与交易有关的客户信息 。
    第三方服务提供者：我们聘请其他公司和个人代表我们履行某些职能。例如：发送信函、电子邮件或短信、清除客户名单中的重复信息、分析数据、提供市场营销帮助、提供搜索结果和链接（包括付费搜索名单和链接）以及提供客户服务。他们能够接触到为履行其职责所需的客户信息，但不能将此信息用于任何其他目的。
    促销：有时我们代表其他企业向所选定的本网站的客户群提供促销活动的服务。在提供此服务时，我们不会向这些企业披露您的姓名和地址。如果您不希望收到这类促销信息，请调整您的帐户中的电子邮件偏好设置 。
    业务转让：为持续发展我们的业务，我们可能会出售或收购商店、子公司或者业务部门。在这些交易中，客户信息通常是所转让企业资产中的一部分，但这些信息（当然除非客户作出其他同意）仍然受制于转让前已有的任何隐私声明所作出的承诺。虽然可能性不大，但在极端的情况下，如果本网站或其关联公司或他们各自的全部资产被收购时，客户信息应是被转让资产的一部分。
    对本网站和其他人的保护：为了遵守法律、执行或适用我们的使用条件和其他协议，或者为了保护本网站、我们的客户或其他人的权利及其财产或安全，我们将会提供帐户或其他个人信息。这包括为防止欺诈等违法活动和减少信用风险而与其他公司和组织交换信息。不过很明显，这并不包括违反本隐私声明中所作的承诺而为获利目的出售、出租、共享或以其它方式披露个人可识别的信息。
    征得您的同意：除以上规定之外，当有关您的信息有可能披露给第三方时，您将会得到通知，并且您将有机会选择不与第三方分享此信息。

关于我的信息安全？

    在信息传输的过程中，我们通过使用网络安全层软件（SSL）对您输入的信息进行加密，从而努力保护您的信息的安全。
    在确认订单时，我们将只显示您信用卡号码的最后四位数字。当然，我们在处理订单过程中会把完整的信用卡号码传送给相关的信用卡机构。
    防止他人未经授权使用您的密码或使用您的计算机或移动设备是非常重要的。因此，您应确保在与他人共用一台计算机或移动设备时，使用完毕后即时退出登录。

第三方广告商和其它网站链接？

我们的网站上有第三方广告和对其它网站的链接。我们不向这些广告商或第三方网站提供可识别的个人信息。这些第三方网站或广告商（或他们的网上广告公司），有时使用技术手段将我们网站上显示的广告直接发到您的浏览器上。这时它们自动获取您的IP地址。它们也可能使用cookies, JavaScript, web beacons等技术来衡量它们广告的效果以及个性化广告内容。我们无法获得亦无从控制它们可能使用的这些cookies或其它技术，而且本隐私政策不适用于这些广告商及第三方网站所从事的行为。请与它们直接联系以获得关于它们隐私政策的详细情况。

本网站也会基于客户的个人信息展示个性化的第三方广告。这些个人信息包括诸如在本网站的购物情况、访问本网站关联公司网站的情况。尽管我们不向广告商提供任何的个人信息，但广告商（包括广告服务公司）可能会认为，如果用户与之互动或点击个性化广告的话，就满足其用于对广告进行个性化的标准。
我能获取哪些信息？

本网站允许您进入与您的账户以及和本网站进行互动有关的信息，这种访问的目的仅限于阅读和在特定情形下更新账户信息。 相关信息将随网站的变化而更新。

我发布信息时应注意些什么？

您在我们网站上发布信息时，如果我们发现您发布法律、法规禁止发布或者传输的信息，我们有权立即停止传输该信息，采取消除等处置措施，保存有关记录，并向有关主管部门报告。

如果有其他客户发现您发布的信息泄露个人身份、散布个人隐私等侵害其合法权益，或您如在我们许可的情况下发布商业性电子信息，而其他客户表示遭受侵扰，这些客户有权要求我们删除您发布的信息，或者采取其他必要措施予以制止。我们将会依法采取这些措施。
我有哪些选择？

    如上所述，您可以选择不提供某些信息，尽管您在采购或者使用本网站的某些服务时被要求提供信息。

    如果您不希望我们使用我们收集的个人信息，允许第三方对我们呈现给您的广告推广进行个性化设置，请调整您的广告选项。
    多数浏览器上工具条中的帮助部分会告诉您怎样防止您的浏览器接受新的cookies，怎样让您的浏览器在您收到一条新cookie时通知您或者怎样彻底关闭cookies。此外，您可以通过改变浏览器附加程序（browser add-ons）的设置，或通过访问其制造商的网页，来关闭或删除浏览器附加程序使用的类似数据（诸如Flash cookies）。然而，cookies能让您充分利用本网站最优秀的特色服务，所以我们建议您将其设置为打开状态。

是否允许儿童使用本网站？

我们不向儿童提供服务。如果您不满18岁，只有在父母或监护人参与的情况下您才能使用本网站。
使用条件、通知和修订？

如果您选择访问本网站，您的访问和有关隐私的争议将受制于本声明和我们的使用条件，包括对赔偿的限制、争议解决和中华人民共和国法律的适用。如果您有任何对本网站上有关隐私问题，请联系我们并作充分描述，我们将尽力解决之。

我们的业务时常变化，我们的隐私声明和使用条件也随之变化。我们会通过电子邮件方式或在本网站上发出更新版本提醒您我们的相关更新，除非您指示我们不要这样做，但您应经常登录我们的网站了解最新使用条件及隐私声明。除另有声明外，现行的隐私政策适用于我们关于您和您的账户的所有信息。我们坚守我们做出的承诺，未经相关客户同意我们不会对我们的政策和惯例作重大修改以至于降低对客户信息的保护程度。

相关惯例和信息请见：

    使用条件
    帮助中心

信息采集实例

您提供给我们的信息

您在使用石管家时或者与客户服务部门联系时会提供我们大部分的信息。例如，您在上架板材信息到搜石网时提供信息，在我的帐户或您的个人信息中提供信息，在与我们通过电话、电子邮件、短信或其他方式交流、参加社区特别活动以及使用任何个人通知服务功能时，您会提供信息。作为这些行为的结果，您可能向我们提供诸如您的姓名、地址和电话号码、公司地址、员工资料设置中的员工名称（包括地址和电话号码和其他个人信息如身份证等）。

自动获取的信息

我们采集和分析信息的例子包括用来把您的计算机或移动设备连接到因特网上的IP地址，登录信息，电子邮件地址，手机号码，密码，计算机和连接信息诸如浏览器的类型、版本和时区设置、浏览器插件类型和版本、操作系统和平台，购物历史记录，我们有时将之与其他客户的类似信息结合起来创造网站特色例如畅销商品，送到或通过或来自我们 网站的完整的URL点击情况，包括日期和时间、cookie数、您浏览或搜索过的商品和您用来联系我们客户服务部门的电话号码。我们也可以使用浏览器数据，如cookies, Flash cookies或我们网站上的类似数据，来防止欺诈和其他违法行为。在有些访问中我们可能使用软件工具诸如JavaScript测量和收集用户连接的信息，包括网页响应次数、下载错误、对特定页的访问时间、页面交互信息（诸如滚动、点击和光标停留）以及结束浏览该页所使用的方法。
移动设备

大多数移动设备为客户提供关闭定位服务的功能。多数情况下，这些设置在设备的设置菜单内。关于一些设备的设置，请点击关闭特定设备上的定位服务。如对于如何关闭您的设备的定位服务仍有疑问，我们建议您联系您的移动设备的服务商或生产商。

从其他来源获得的信息

我们从其他来源获得的信息的例子包括通过我们的合作企业获得的页面阅览信息；通过我们的关联企业Alexa Internet提供的网络搜索服务而得到的搜索名词和搜索结果等信息；搜索结果和链接，包括付费搜索名单。
                            </pre>
                        </div>
                    </div>
                    <!-- Add Scroll Bar -->
                    <div class="swiper-scrollbar"></div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
	export default {
		methods:{
			_swiper(){
				new Swiper('.swiper-container', {
	                scrollbar: '.swiper-scrollbar',
	                direction: 'vertical',
	                slidesPerView: 'auto',
	                freeMode: true,
	                freeModeMomentumRatio : 2               
	            });   
			}
		},
		mounted (){
			// this._swiper();
		}
	}
</script>
<style scoped>
	html, body {
    height: 100%;
    overflow: auto;
    position: relative;
}

body {
    background: #fff;
    font-size: 14px;
    color:#000;
    margin: 0;
    padding: 0;
}

.g-doc, .wraper, .container{
    height: 100%;
}

.swiper-container {
    width: 100%;
    height: 90%;
}

.swiper-slide {
    font-size: 18px;
    height: auto;
    -webkit-box-sizing: border-box;
    box-sizing: border-box;
    padding: 30px;
}

.swiper-slide pre{
    white-space: pre-wrap;
    word-wrap: break-word;
    font-size: 24px;
    line-height: 28px;
}


</style>